# YOLO Segmentation Model with integrated C3-CoordinateAttention blocks
# Architecture for 'x' size (width_multiple=1.25, channels pre-calculated)

# Parameters
nc: 2  # number of classes

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [80, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [160, 3, 2]]         # 1-P2/4
  - [-1, 3, C3, [320, True]]           # 2 (Cambiado a 3 repeticiones y C3 estándar)
  - [-1, 1, Conv, [320, 3, 2]]         # 3-P3/8
  - [-1, 6, C3, [640, True]]           # 4 (Cambiado a 6 repeticiones y C3 estándar)
  - [-1, 1, Conv, [640, 3, 2]]         # 5-P4/16
  - [-1, 6, C3CA, [640, True]]         # 6 <-- USANDO NUESTRO C3CA
  - [-1, 1, Conv, [1600, 3, 2]]        # 7-P5/32
  - [-1, 3, C3CA, [1600, True]]        # 8 <-- USANDO NUESTRO C3CA
  - [-1, 1, SPPF, [1600, 5]]           # 9

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 6], 1, Concat, [1]]                   # 11: cat backbone P4
  - [-1, 3, C3, [640, False]]                   # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 4], 1, Concat, [1]]                   # 14: cat backbone P3
  - [-1, 3, C3, [320, False]]                   # 15 (P3/8-small)

  - [-1, 1, Conv, [320, 3, 2]]                  # 16
  - [[-1, 12], 1, Concat, [1]]                  # 17: cat head P4
  - [-1, 3, C3, [640, False]]                   # 18 (P4/16-medium)

  - [-1, 1, Conv, [640, 3, 2]]                  # 19
  - [[-1, 9], 1, Concat, [1]]                   # 20: cat head P5
  - [-1, 3, C3, [1600, False]]                  # 21 (P5/32-large)

  - [[15, 18, 21], 1, Segment, [nc, 32, 256]]   # 22, Segment head